app/controllers/bloggenres_controller.rb

  def indeex
    @data = Bloggenre.all
---
SELECT "bloggenres".* FROM "bloggenres"