app/controllers/blogposts_controller.rb

  def index
    @data = Blogpost.all.order('created_at desc')
---
SELECT "blogposts".* FROM "blogposts" ORDER BY created_at desc

  def add
    @blogpost = Blogpost.new
    @genres = Bloggenre.all
---
SELECT "bloggenres".* FROM "bloggenres"