app/controllers/blogs_controller.rb

SELECT "blogposts".* FROM "blogposts" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @data = Blogpost.order('created_at desc').page params[:page]
    @blogconfig = Blogconfig.find 1