app/controllers/blogconfigs_controller.rb

SELECT "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @blogconfig = Blogconfig.find 1

SELECT "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogconfigs" SET "stylename" = ?, "updated_at" = ? WHERE "blogconfigs"."id" = ?  [["stylename", "red"], ["updated_at", "2020-12-29 06:45:43.895995"], ["id", 1]]
---
  def edit
    @blogconfig = Blogconfig.find 1
    if request.patch? then
      @blogconfig.update blogconfig_params