app/controllers/board_users_controller.rb

  def index
    users = BoardUser.where 'account_id == ?', current_account.id
---
SELECT "board_users".* FROM "board_users" WHERE (account_id == 2)

  def update
    respond_to do |format|
      if @board_user.update(board_user_params)
---
UPDATE "board_users" SET "nickname" = ?, "memo" = ?, "updated_at" = ? WHERE "board_users"."id" = ?  [["nickname", "やっち"], ["memo", "好きな食べ物はアボカドです。"], ["updated_at", "2020-12-25 07:22:15.086298"], ["id", 1]]

    def set_board_user
      @board_user = BoardUser.find(params[:id])
---
SELECT "board_users".* FROM "board_users" WHERE "board_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]