app/controllers/board_messages_controller.rb

SELECT "board_messages".* FROM "board_messages" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "board_users".* FROM "board_users" WHERE (account_id == 2)
INSERT INTO "board_users" ("nickname", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nickname", "<<no name>>"], ["account_id", 2], ["created_at", "2020-12-25 06:56:08.691428"], ["updated_at", "2020-12-25 06:56:08.691428"]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def index
    @board_messages = BoardMessage.page(params[:page]).order('created_at desc')
    users = BoardUser.where('account_id == ?', current_account.id)[0]
    if users == nil then
      user = BoardUser.new
      user.account_id = current_account.id
      user.nickname = '<<no name>>'
      user.save
      users = BoardUser.where('account_id == ?', current_account.id)

SELECT "board_messages".* FROM "board_messages" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "board_users".* FROM "board_users" WHERE (account_id == 2)
---
  def create
    @board_messages = BoardMessage.page(params[:page]).order('created_at desc')
    @board_message = BoardMessage.new(board_message_params)
    @board_user = BoardUser.where('account_id == ?', current_account.id)[0]